
# Задание task_01_01.
""" Составьте программу, которая запрашивает у пользователя 2 целых числа и выполняет операции:
•	арифметические: +, -, * , / , // , %, **;
•	сравнение: <, <=, >, >=, !=, ==,
выводя на экран результат каждого действия. В случае получение вещественного результата, округлите его до 2-х знаков после запятой (используя функцию round()).
"""
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241


a = int(input("a="))
b = int(input("b="))

print(a + b)
print(a-b)
print (a*b)
print(round (a/b, 2))
print(a//b)
print(a%b)
print(a**b)


print(a < b)
print(a<=b)
print(a>b)
print(a>=b)
print(a!=b)
print(a==b)


# --------------
# Пример вывода:
#
# a=2
# b=3
# 5
# -1
# 6
# 0.67
# 0
# 2
# 8
# True
# True
# False
# False
# True
# False
