# Задание task_01_08.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ - 241


# Название государства
country = input("Введите название государства: ")
# Название столицы
capital = input("Введите название столицы: ")

print("Государство - {word1}, столица - {word2}".format(word1 = country, word2 = capital))


# --------------
# Пример вывода:
#
# Введите название государства: Россия
# Введите название столицы: Москва
# Государство - Россия, столица - Москва
