# Задание task_01_06.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241


a = int(input('a='))
b = int(input('b='))
m = int(input('m='))
n = int(input('n='))

# x = print(-b/a)

# is_ok = print(m<=x<=n)

print(("Попадает:"),(m<(-b/a)<n))


# --------------
# Пример вывода:
#
# Введите a = 1
# Введите b = 2
# Введите m = -5
# Введите n = 5
# Попадает: True
