
# Задание task_02_31.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241



s = input('Введите предложение = ') # Предложение
k = input('Введите букву = ') # Буква

s_s = s.split()
s = []

for i in range(len(s_s)):
    if k.lower() not in s_s[i] and k.upper() not in s_s[i]:
        s.append(s_s[i])

s = ' '.join(s)
print(s)



# --------------
# Пример вывода:
#
# Введите предложение = МАМА мыла РаМу
# Введите букву = р
# МАМА мыла