
# Задание task_02_28.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241


k = int(input('k = '))

for x in range(1, 31):
    for y in range(1, 31):
        for z in range(1, 31):
           if k**2 == x**2 + y**2 + z**2:
               print(f'x = {x}, y = {y}, z = {z}', end='\t')
               print()


# -------------
# Пример вывода:
#
# k = 30
# x =  4, y = 10, z = 28
# x =  4, y = 20, z = 22
# x =  4, y = 22, z = 20
# x =  4, y = 28, z = 10
# x = 10, y =  4, z = 28
# x = 10, y = 20, z = 20
# x = 10, y = 28, z =  4
# x = 20, y =  4, z = 22
# x = 20, y = 10, z = 20
# x = 20, y = 20, z = 10
# x = 20, y = 22, z =  4
# x = 22, y =  4, z = 20
# x = 22, y = 20, z =  4
# x = 28, y =  4, z = 10
# x = 28, y = 10, z =  4
