
# Задание task_02_01.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241



x = int(input())

if x >= 0:
    f = x ** 0.5 + x**2
else:
    f = 1 / x

print(round (f, 2))

# --------------
# Пример вывода:
#
# Введите число x: -10
# f = -0.10

# Введите число x: 0
# f = 0.00

# Введите число x: 10
# f = 103.16
