
# Задание task_02_26.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241



n = int(input('n = '))

for i in range(1, n+1): # пробег по числам
    count = 0
    for j in range(1, i+1): # пробег по делителям
        if i % j == 0:
            count += 1
    print(i, count*'*')


# --------------
# Пример вывода:
#
# n = 10
# 1 *
# 2 **
# 3 **
# 4 ***
# 5 **
# 6 ****
# 7 **
# 8 ****
# 9 ***
# 10 ****