
# Задание task_02_21.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241



n = int(input('n = '))

r_sr_m = 0.0
r_sr_d = 0.0

n_count = 0
d_count = 0 # кол-во девочек
r_d = 0 # суммарный рост девочек
m_count = 0 # кол-во мальчиков
r_m = 0 # суммарный рост мальчиков

while n_count < n:
    n_count += 1
    r = float(input(f'Рост {n_count}-го ученика = '))
    if r > 0:
        d_count += 1
        r_d += r
    else:
        m_count += 1
        r_m += r

r_sr_d = r_d  / d_count
r_sr_m = abs(r_m / m_count)

print("Средний рост мальчиков: {:.1f}".format(r_sr_m))
print("Средний рост девочек: {:.1f}".format(r_sr_d))

# --------------
# Пример вывода:
#
# n = 5
# Рост 1-го ученика = 150
# Рост 2-го ученика = -150
# Рост 3-го ученика = 160
# Рост 4-го ученика = 170
# Рост 5-го ученика = 180
# Средний рост мальчиков: 150.0
# Средний рост девочек: 165.0
