
# Задание task_02_06.
#
# Выполнил: Гловели Д. К.
# Группа: ЦИБ-241



a = int(input())
b = int(input())
c = int(input())

# Расчет дискриминанта
D = b**2 - 4*a*c

# Вывод решения в зависимости от значения дискриминанта
# При выводе значений оставьте 1 знак после запятой
if D > 0:
    x1 = (-b + D**0.5)/2*a
    x2 = (-b - D**0.5)/2*a
    print(round ('x1 = {x1}, x2 = {x2}'.format(x1 = x1, x2 = x2), 1))
elif D == 0:
    x = (-b)/2*a
    print(round ('x = {x}'.format(x = x), 1))
else:
    print('Нет действительных корней')

# --------------
# Пример вывода:
#
# a = 1
# b = 2
# c = 3
# Решений нет
#
# a = 1
# b = 2
# c = 1
# x = -1.0
#
# a = 1
# b = 3
# c = -4
# x1 = -4.0, x2 = 1.0
